testesrails/simpleApi/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    if @book.save
---
INSERT INTO "books" ("title", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Rails"], ["author", "John Doe"], ["created_at", "2016-10-10 03:15:00.151751"], ["updated_at", "2016-10-10 03:15:00.151751"]]